{"format": "layers-model", "generatedBy": "keras v3.8.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": {"keras_version": "3.8.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "Financial_Classifier_Hypermodel", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 15], "dtype": "float32", "sparse": false, "name": "Input_Layer"}}, {"class_name": "Dense", "config": {"name": "Dense_Hidden_Layer_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 160, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm_Hidden_Layer_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": 1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}}, {"class_name": "Activation", "config": {"name": "Activation_Hidden_Layer_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "activation": "silu"}}, {"class_name": "Dropout", "config": {"name": "Dropout_Hidden_Layer_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "rate": 0.30000000000000004, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"name": "Dense_Hidden_Layer_2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 128, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm_Hidden_Layer_2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": 1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}}, {"class_name": "Activation", "config": {"name": "Activation_Hidden_Layer_2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "activation": "selu"}}, {"class_name": "Dropout", "config": {"name": "Dropout_Hidden_Layer_2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "rate": 0.15000000000000002, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"name": "Output_Layer", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 3, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}], "build_input_shape": [null, 15]}}, "training_config": {"loss": "categorical_crossentropy", "loss_weights": null, "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}]], "weighted_metrics": null, "run_eagerly": false, "steps_per_execution": 1, "jit_compile": false, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.00016667001182213426, "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "loss_scale_factor": null, "gradient_accumulation_steps": null, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "Financial_Classifier_Hypermodel/BatchNorm_Hidden_Layer_1/gamma", "shape": [160], "dtype": "float32"}, {"name": "Financial_Classifier_Hypermodel/BatchNorm_Hidden_Layer_1/beta", "shape": [160], "dtype": "float32"}, {"name": "Financial_Classifier_Hypermodel/BatchNorm_Hidden_Layer_1/moving_mean", "shape": [160], "dtype": "float32"}, {"name": "Financial_Classifier_Hypermodel/BatchNorm_Hidden_Layer_1/moving_variance", "shape": [160], "dtype": "float32"}, {"name": "Financial_Classifier_Hypermodel/BatchNorm_Hidden_Layer_2/gamma", "shape": [128], "dtype": "float32"}, {"name": "Financial_Classifier_Hypermodel/BatchNorm_Hidden_Layer_2/beta", "shape": [128], "dtype": "float32"}, {"name": "Financial_Classifier_Hypermodel/BatchNorm_Hidden_Layer_2/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "Financial_Classifier_Hypermodel/BatchNorm_Hidden_Layer_2/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "Financial_Classifier_Hypermodel/Dense_Hidden_Layer_1/kernel", "shape": [15, 160], "dtype": "float32"}, {"name": "Financial_Classifier_Hypermodel/Dense_Hidden_Layer_1/bias", "shape": [160], "dtype": "float32"}, {"name": "Financial_Classifier_Hypermodel/Dense_Hidden_Layer_2/kernel", "shape": [160, 128], "dtype": "float32"}, {"name": "Financial_Classifier_Hypermodel/Dense_Hidden_Layer_2/bias", "shape": [128], "dtype": "float32"}, {"name": "Financial_Classifier_Hypermodel/Output_Layer/kernel", "shape": [128, 3], "dtype": "float32"}, {"name": "Financial_Classifier_Hypermodel/Output_Layer/bias", "shape": [3], "dtype": "float32"}]}]}
